{
  "backend/main.mo": "Motoko backend defining types and CRUD logic for users, products, deals, reviews, carts, and orders with access control enforcement.",
  "feature_evidence.json": "Feature evidence report listing feature implementations, associated files, components, and test IDs with high-confidence tracking.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short human-written summaries describing each file’s purpose.",
  "frontend/docs/app-feature-list.md": "Documentation outlining the full feature set of the KindLink app including authentication, communities, moderation, and excluded features.",
  "frontend/docs/basic-screen-layout-ideas.md": "Notes describing mobile‑first layout principles and common screen structure guidelines for the app.",
  "frontend/docs/user-flow.md": "Detailed user‑flow documentation covering onboarding, navigation, content posting, moderation, and safety flows.",
  "frontend/index.css": "Tailwind CSS configuration defining theme variables, light/dark mode values, and base styling tokens.",
  "frontend/index.html": "HTML entry point setting the document title and loading the React app root.",
  "frontend/src/App.tsx": "Sets up the main app layout, authentication gate, onboarding logic, and all TanStack Router routes for the mobile shopping app.",
  "frontend/src/components/AdminRoute.tsx": "Empty file.",
  "frontend/src/components/AuthGate.tsx": "Shows a login screen using Internet Identity with branding and a button to initiate authentication.",
  "frontend/src/components/BottomNav.tsx": "Renders the mobile bottom navigation bar with icons, active highlighting, and cart badge count.",
  "frontend/src/components/ChallengeShareComposer.tsx": "Dialog for composing and anonymously submitting challenge completion text with validation and toast feedback.",
  "frontend/src/components/CommunityGuidelinesBanner.tsx": "Displays an alert banner summarizing community guidelines for respectful behavior.",
  "frontend/src/components/CommunityPicker.tsx": "Empty file.",
  "frontend/src/components/ContentActionsMenu.tsx": "Provides reporting, muting, and blocking actions for content using a dropdown menu and local safety preferences.",
  "frontend/src/components/ContentAuthorLabel.tsx": "Empty file.",
  "frontend/src/components/GoodDeedCard.tsx": "Empty file.",
  "frontend/src/components/GoodDeedComposer.tsx": "Dialog allowing users to write and submit a good deed with optional tags and anonymous posting.",
  "frontend/src/components/HelpRequestComposer.tsx": "Dialog for creating help requests with category selection, description input, and optional anonymity.",
  "frontend/src/components/MobileScaffold.tsx": "Provides the mobile app layout wrapper and conditionally shows the bottom navigation bar.",
  "frontend/src/components/PostingGuard.tsx": "Blocks posting if the user lacks permission and shows an alert message, otherwise renders children.",
  "frontend/src/components/ReportDialog.tsx": "A dialog component allowing users to submit a report with a reason, handling validation, submission, and status toasts.",
  "frontend/src/components/shop/AppliedFilterChips.tsx": "Displays applied shop filters as removable chips, including vibe tags and price range, with a clear-all option.",
  "frontend/src/components/shop/BrandBackground.tsx": "Renders a fixed low-opacity branded background image behind the shop UI.",
  "frontend/src/components/shop/CartLineItem.tsx": "Shows a cart item with product info, quantity controls, price calculation, and a remove button.",
  "frontend/src/components/shop/CategoryStrip.tsx": "Horizontal scrollable list of category buttons that navigate to a filtered search page.",
  "frontend/src/components/shop/DealCard.tsx": "Clickable card presenting a deal’s details, discount badge, and preview of included products.",
  "frontend/src/components/shop/FilterSheet.tsx": "Bottom sheet UI for adjusting price, vibe tags, and sort options, with apply and reset actions.",
  "frontend/src/components/shop/InfluencerPickBadge.tsx": "A decorative animated badge marking an item as an Influencer Pick.",
  "frontend/src/components/shop/OrderStatusTimeline.tsx": "Visual timeline showing an order’s progress across processing, shipped, and delivered stages.",
  "frontend/src/components/shop/PageContainer.tsx": "Simple wrapper providing padded page layout for shop views.",
  "frontend/src/components/shop/PreferencesForm.tsx": "Form for editing a user's style preferences, including budget, vibes, and categories, with save handling.",
  "frontend/src/components/shop/ProductCard.tsx": "Displays a product with image, price, tags, wishlist button, and optional influencer badge, navigating to its detail page.",
  "frontend/src/components/shop/ProductGrid.tsx": "Renders a responsive product grid with loading and empty states.",
  "frontend/src/components/shop/RecommendationsShelf.tsx": "Shows personalized product recommendations with loading skeletons and horizontal scrolling.",
  "frontend/src/components/shop/ReelItem.tsx": "Displays a product reel with video or image, play/mute controls, and a shop button, syncing playback with active state.",
  "frontend/src/components/shop/ReelsFeed.tsx": "Scrollable vertical container that arranges reel items with snap scrolling.",
  "frontend/src/components/shop/ReviewsSection.tsx": "Handles displaying reviews, average rating, and submitting new reviews with authentication checks.",
  "frontend/src/components/shop/Skeletons.tsx": "Provides skeleton loading components for product cards, grids, and deal cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to identity changes, invalidating related queries on updates.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity login/logout and exposes authentication status.",
  "frontend/src/hooks/useDailyChallengeLocalState.ts": "Stores and retrieves local daily challenge completion data in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling auth client creation, identity loading, and login state.",
  "frontend/src/hooks/useLocalSafetyPreferences.ts": "Manages local mute/block preferences for users using localStorage.",
  "frontend/src/hooks/useModeration.ts": "Empty placeholder file.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file.",
  "frontend/src/hooks/useReelsPlayback.ts": "Tracks active reel index and manages mute/play controls and navigation.",
  "frontend/src/hooks/useSelectedCommunity.ts": "Empty placeholder file.",
  "frontend/src/hooks/useShopQueries.ts": "Defines React Query hooks for products, deals, cart, reviews, and user profiles using the backend actor.",
  "frontend/src/hooks/useWishlist.ts": "Hook managing a user-specific wishlist stored in localStorage with add, remove, check, and clear helpers.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme variables, base styles, and utility classes including shimmer and scrollbar-hide.",
  "frontend/src/main.tsx": "App entrypoint mounting React, providing React Query and Internet Identity contexts.",
  "frontend/src/pages/ChatRoomPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ChatRoomsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/DailyChallengePage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/GoodDeedsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/HelpRequestDetailPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/HelpRequestsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/ModeratorDashboardPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/OnboardingPage.tsx": "Onboarding form where users enter basic profile info and save it via shop query hooks.",
  "frontend/src/pages/SettingsPage.tsx": "Empty placeholder page component.",
  "frontend/src/pages/shop/CartPage.tsx": "Displays cart items with quantity controls, product info mapping, and checkout navigation.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Checkout form allowing profile update, address entry, and order placement.",
  "frontend/src/pages/shop/CollectionPage.tsx": "Shows filtered product collections with price/vibe filters and budget-based collections.",
  "frontend/src/pages/shop/DealsPage.tsx": "Renders flash sales and daily deals with skeleton loading states using shop query hooks.",
  "frontend/src/pages/shop/HomePage.tsx": "Renders the main shop landing page with category strips, featured products, under-budget sections, and navigation buttons.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays detailed order info including items, tracking, shipping address, and total, fetched by order ID.",
  "frontend/src/pages/shop/OrdersPage.tsx": "Shows a list of the user's orders sorted by date with status badges and navigation to order details.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Shows a product's images, price, tags, and actions like add to cart or wishlist, fetched by product ID.",
  "frontend/src/pages/shop/ProfilePage.tsx": "Displays user profile details, navigation shortcuts, style preferences form, and logout option.",
  "frontend/src/pages/shop/ReelsPage.tsx": "Builds a reels-style feed of products with video or image previews using playback controls.",
  "frontend/src/pages/shop/SearchPage.tsx": "Provides product search with filters, search input, and a grid of filtered results.",
  "frontend/src/pages/shop/WishlistPage.tsx": "Shows the user's saved wishlist products or an empty state if none exist.",
  "frontend/src/utils/shopFilters.ts": "Implements product filtering by price, vibe/trend tags, and sorting, plus a helper for fetching items under a given budget.",
  "frontend/src/utils/shopFormat.ts": "Provides formatting helpers for prices, vibe tags, categories, and order statuses.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, fonts, animations, and enabling dark mode with custom utilities.",
  "project_state.json": "Project metadata describing app purpose, architecture, features, and configuration notes."
}