{
  "backend/main.mo": "Main canister defining user profiles, products, deals, reviews, carts, orders, and authorization-protected CRUD/query operations.",
  "backend/migration.mo": "Migration module converting old community-based actor state into new shopping-app-compatible data structures with defaulted fields.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs for planning.",
  "frontend-file-summaries.txt": "Prewritten summaries of several frontend components including moderator dashboard, settings, and shop preference-related UI.",
  "frontend/docs/app-feature-list.md": "Documentation listing core app features, excluded features, and design philosophy for the original KindLink app.",
  "frontend/docs/basic-screen-layout-ideas.md": "Notes describing mobile-first layout principles and common screen structure guidelines.",
  "frontend/docs/user-flow.md": "Detailed walkthrough of user flows including onboarding, community usage, chat, help requests, challenges, good deeds, settings, and moderation.",
  "frontend/index.css": "Tailwind CSS configuration defining global theme variables, light/dark modes, and base styling.",
  "frontend/index.html": "Root HTML file mounting the app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Sets up the app’s root layout, routing tree, and authentication/onboarding flow using TanStack Router.",
  "frontend/src/components/AdminRoute.tsx": "Empty file.",
  "frontend/src/components/AuthGate.tsx": "Displays a login screen using Internet Identity with branded UI and a login button.",
  "frontend/src/components/BottomNav.tsx": "Renders a mobile bottom navigation bar with route-aware highlighting and cart badge counts.",
  "frontend/src/components/ChallengeShareComposer.tsx": "Provides a dialog for anonymously sharing challenge completion text with validation and toasts.",
  "frontend/src/components/CommunityGuidelinesBanner.tsx": "Shows a simple alert banner with community guideline text.",
  "frontend/src/components/CommunityPicker.tsx": "Empty file.",
  "frontend/src/components/ContentActionsMenu.tsx": "Menu for reporting, muting, or blocking a content author using local safety preferences.",
  "frontend/src/components/ContentAuthorLabel.tsx": "Empty file.",
  "frontend/src/components/GoodDeedCard.tsx": "Empty file.",
  "frontend/src/components/GoodDeedComposer.tsx": "Dialog for submitting a good deed with text, tags, and anonymous posting options.",
  "frontend/src/components/HelpRequestComposer.tsx": "Dialog for submitting a help request with category selection, description, and anonymity toggle.",
  "frontend/src/components/MobileScaffold.tsx": "Wraps pages in a mobile layout and conditionally shows the bottom navigation bar.",
  "frontend/src/components/PostingGuard.tsx": "Blocks posting actions with an alert if the user lacks permission, otherwise renders children.",
  "frontend/src/components/ReportDialog.tsx": "Modal dialog for submitting a report with a reason field, validation, and async submission handling.",
  "frontend/src/components/shop/AppliedFilterChips.tsx": "Displays active shop filters as removable chips with a clear-all option.",
  "frontend/src/components/shop/BrandBackground.tsx": "Renders a fixed low-opacity background image for branding.",
  "frontend/src/components/shop/CartLineItem.tsx": "Shows a cart item with image, quantity controls, price, and remove button.",
  "frontend/src/components/shop/CategoryStrip.tsx": "Horizontal category buttons that navigate to filtered search results.",
  "frontend/src/components/shop/DealCard.tsx": "Clickable card showing a deal’s title, discount, and preview of products.",
  "frontend/src/components/shop/FilterSheet.tsx": "Bottom sheet for adjusting price, vibe tags, and sort options, with apply/reset actions.",
  "frontend/src/components/shop/InfluencerPickBadge.tsx": "Animated badge indicating an influencer-recommended product.",
  "frontend/src/components/shop/OrderStatusTimeline.tsx": "Visual timeline showing progress through order statuses.",
  "frontend/src/components/shop/PageContainer.tsx": "Simple layout wrapper providing padded full‑height page container.",
  "frontend/src/components/shop/PreferencesForm.tsx": "Form for editing user style preferences including budget, vibes, and categories.",
  "frontend/src/components/shop/ProductCard.tsx": "Product preview card with wishlist toggle, price, tags, and optional influencer badge.",
  "frontend/src/components/shop/ProductGrid.tsx": "Renders a 2‑column product grid with loading and empty states.",
  "frontend/src/components/shop/RecommendationsShelf.tsx": "Displays personalized recommended products or skeletons while loading.",
  "frontend/src/components/shop/ReelItem.tsx": "Displays a product reel with video or image, playback controls, and a button to navigate to the product page.",
  "frontend/src/components/shop/ReelsFeed.tsx": "Provides a vertically scrollable, snap-based container for reel items.",
  "frontend/src/components/shop/ReviewsSection.tsx": "Shows product reviews, average rating, and a form for authenticated users to submit new reviews.",
  "frontend/src/components/shop/Skeletons.tsx": "Contains skeleton loader components for product cards, grids, and deal cards.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.ts": "Wraps Internet Identity auth functions and provides login state and logout with cache clearing.",
  "frontend/src/hooks/useDailyChallengeLocalState.ts": "Manages localStorage-backed daily challenge completion state with save and lookup helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, login handling, and identity persistence via AuthClient.",
  "frontend/src/hooks/useLocalSafetyPreferences.ts": "Stores muted and blocked user lists in localStorage and provides helpers to update and check them.",
  "frontend/src/hooks/useModeration.ts": "Empty placeholder file.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file.",
  "frontend/src/hooks/useReelsPlayback.ts": "Manages reel playback state including active index, mute state, and play/pause toggles.",
  "frontend/src/hooks/useSelectedCommunity.ts": "Empty placeholder file.",
  "frontend/src/hooks/useShopQueries.ts": "Defines React Query hooks for fetching and mutating shop data such as products, deals, carts, and reviews via the backend actor.",
  "frontend/src/hooks/useWishlist.ts": "Provides a wishlist hook that stores per-user product IDs in localStorage and exposes add, remove, check, and clear functions.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables for light/dark modes, and utility classes including scrollbar hiding and shimmer animation.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the Internet Identity provider.",
  "frontend/src/pages/ChatRoomPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/ChatRoomsPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/DailyChallengePage.tsx": "Empty page placeholder.",
  "frontend/src/pages/GoodDeedsPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/HelpRequestDetailPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/HelpRequestsPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/ModeratorDashboardPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/OnboardingPage.tsx": "Renders a form to create or update the user profile with name and email, calling profile-save mutations on submit.",
  "frontend/src/pages/SettingsPage.tsx": "Empty page placeholder.",
  "frontend/src/pages/shop/CartPage.tsx": "Displays cart items with quantity controls, totals, and navigation to checkout using shop query hooks.",
  "frontend/src/pages/shop/CheckoutPage.tsx": "Handles checkout flow by capturing shipping/email info, saving profile updates, placing orders, and navigating to order details.",
  "frontend/src/pages/shop/CollectionPage.tsx": "Shows products for a selected collection with filter controls and dynamic filtering logic.",
  "frontend/src/pages/shop/DealsPage.tsx": "Displays flash sales and daily deals, showing skeletons while loading and mapping deal data into cards.",
  "frontend/src/pages/shop/HomePage.tsx": "Renders the shop home page with category navigation, featured items, budget filters, and recommendations using product data.",
  "frontend/src/pages/shop/OrderDetailPage.tsx": "Displays details for a specific order including items, status, shipping info, and total cost.",
  "frontend/src/pages/shop/OrdersPage.tsx": "Lists the user's orders sorted by date with status, item count, and total, linking to detail pages.",
  "frontend/src/pages/shop/ProductDetailPage.tsx": "Shows full product details, images, tags, reviews, and supports adding to cart or toggling wishlist.",
  "frontend/src/pages/shop/ProfilePage.tsx": "Shows and edits the user's profile, provides navigation to orders and wishlist, and supports logout.",
  "frontend/src/pages/shop/ReelsPage.tsx": "Displays a vertical reels feed generated from products with video or image previews using playback controls.",
  "frontend/src/pages/shop/SearchPage.tsx": "Provides product search with filter controls, search input, and a dynamically updated product grid.",
  "frontend/src/pages/shop/WishlistPage.tsx": "Shows products saved in the user's wishlist or an empty‑state prompt when none exist.",
  "frontend/src/utils/shopFilters.ts": "Provides filtering and sorting utilities for products based on price, vibe/trend tags, and sort options, plus a helper for selecting items under a price limit.",
  "frontend/src/utils/shopFormat.ts": "Contains formatting helpers for prices, vibe tags, categories, and order statuses using predefined label maps.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing/retrieving values in sessionStorage, and handling persisted parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radius, fonts, and animations, with dark mode support and plugin usage.",
  "project_state.json": "Stores project metadata including architecture notes, features list, image requirements, and versioned state information."
}