{
  "kind": "build_request",
  "title": "Apply brand rename to Lowkey Luxurious and update under-budget labels to ₹500/₹1000",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-14",
      "text": "Rename the app’s user-facing brand name from \"Vibe Shop\" to \"Lowkey Luxurious\" wherever it appears in the shopping experience (including AuthGate and the Shop Home header), and update the app HTML document title to match the new name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Change the name to \"Lowkey Luxurious\""
        ]
      },
      "acceptanceCriteria": [
        "AuthGate shows the title text \"Lowkey Luxurious\" instead of \"Vibe Shop\".",
        "Shop Home page header shows \"Lowkey Luxurious\" instead of \"Vibe Shop\".",
        "The browser tab title (frontend/index.html <title>) is \"Lowkey Luxurious\" (not \"KindLink\").",
        "No visible \"Vibe Shop\" string remains in the primary shopping entry screens (AuthGate + Shop Home)."
      ]
    },
    {
      "id": "REQ-15",
      "text": "Update all under-budget UI labels currently shown as \"Under ₹20\" and \"Under ₹35\" to instead display \"Under ₹500\" and \"Under ₹1000\" in the Shop Home page and the corresponding collection page title.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Listen change \"Under ₹20\" and \"Under ₹35\" to \"Under ₹500\" and \"Under ₹1000\""
        ]
      },
      "acceptanceCriteria": [
        "On Shop Home, the quick collection buttons read \"Under ₹500\" and \"Under ₹1000\" (not ₹20/₹35).",
        "On Shop Home, the under-budget section header reads \"Under ₹1000\" (or matches the chosen under-budget section shown) and does not reference ₹35.",
        "On Collection page, when navigating to the under-budget collections, the page title displays \"Under ₹500\" or \"Under ₹1000\" accordingly."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Update under-budget collection routing and filtering logic so that the under-budget collections actually filter products at the new thresholds (≤500 and ≤1000 INR) and the collectionId slugs used by the Home quick buttons match what CollectionPage understands.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Listen change \"Under ₹20\" and \"Under ₹35\" to \"Under ₹500\" and \"Under ₹1000\""
        ]
      },
      "acceptanceCriteria": [
        "Clicking the \"Under ₹500\" button on Home navigates to a collection route whose collectionId is recognized and filters products with price <= 500.",
        "Clicking the \"Under ₹1000\" button on Home navigates to a collection route whose collectionId is recognized and filters products with price <= 1000.",
        "The Home page’s under-budget product shelf uses the updated threshold (<= 1000) so it can surface products priced between ₹36–₹1000.",
        "No code path still filters under-budget collections using 20 or 35 as max price."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Adjust default price-range filter state on CollectionPage and SearchPage so that the new under-budget collections (up to ₹1000) are not accidentally hidden by the default max price filter.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "Listen change \"Under ₹20\" and \"Under ₹35\" to \"Under ₹500\" and \"Under ₹1000\""
        ]
      },
      "acceptanceCriteria": [
        "On CollectionPage, opening an under-budget collection does not show an artificially reduced set of products due to an initial default max price of 200.",
        "On SearchPage, the initial filter state allows browsing products priced above ₹200 without requiring the user to change filters first."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit any files under frontend/src/components/ui (compose them instead).",
    "Do not modify files in frontend/immutablePaths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Maintain the existing Internet Identity authentication gate behavior."
  ],
  "nonGoals": [
    "Do not add new product catalog features, new routes, or new backend APIs beyond what is required for the rename and under-budget threshold updates.",
    "Do not change currency formatting (INR formatting is already implemented).",
    "Do not introduce any external integrations (payments, third-party auth, analytics)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}