{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Rename brand to Lowkey Luxurious and update under-budget thresholds to ₹500/₹1000",
  "requirements": [
    {
      "id": "REQ-14",
      "summary": "Rename the user-facing brand name to \"Lowkey Luxurious\" across AuthGate, Shop Home header, and the HTML document title.",
      "acceptanceCriteria": [
        "AuthGate shows the title text \"Lowkey Luxurious\" instead of \"Vibe Shop\".",
        "Shop Home page header shows \"Lowkey Luxurious\" instead of \"Vibe Shop\".",
        "The browser tab title (frontend/index.html <title>) is \"Lowkey Luxurious\" (not \"KindLink\").",
        "No visible \"Vibe Shop\" string remains in the primary shopping entry screens (AuthGate + Shop Home)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the HTML document <title> to \"Lowkey Luxurious\" to match the renamed brand."
        },
        {
          "path": "frontend/src/components/AuthGate.tsx",
          "operation": "modify",
          "description": "Replace the AuthGate branded title text from \"Vibe Shop\" to \"Lowkey Luxurious\" while preserving existing Internet Identity authentication gate behavior and UI composition."
        },
        {
          "path": "frontend/src/pages/shop/HomePage.tsx",
          "operation": "modify",
          "description": "Replace the Shop Home header brand text from \"Vibe Shop\" to \"Lowkey Luxurious\" without changing navigation structure or adding new routes."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Update under-budget labels from \"Under ₹20/₹35\" to \"Under ₹500/₹1000\" on Home and the corresponding Collection page title.",
      "acceptanceCriteria": [
        "On Shop Home, the quick collection buttons read \"Under ₹500\" and \"Under ₹1000\" (not ₹20/₹35).",
        "On Shop Home, the under-budget section header reads \"Under ₹1000\" (or matches the chosen under-budget section shown) and does not reference ₹35.",
        "On Collection page, when navigating to the under-budget collections, the page title displays \"Under ₹500\" or \"Under ₹1000\" accordingly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/shop/HomePage.tsx",
          "operation": "modify",
          "description": "Update Home quick collection button labels to \"Under ₹500\" and \"Under ₹1000\", and update the under-budget shelf header/CTA label text to match the new thresholds."
        },
        {
          "path": "frontend/src/pages/shop/CollectionPage.tsx",
          "operation": "modify",
          "description": "Update under-budget collection title mapping so CollectionPage displays \"Under ₹500\" and \"Under ₹1000\" for the corresponding under-budget collections."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Update under-budget collection navigation slugs and filtering thresholds so Home and CollectionPage agree on collectionId and filter by ≤500/≤1000 INR.",
      "acceptanceCriteria": [
        "Clicking the \"Under ₹500\" button on Home navigates to a collection route whose collectionId is recognized and filters products with price <= 500.",
        "Clicking the \"Under ₹1000\" button on Home navigates to a collection route whose collectionId is recognized and filters products with price <= 1000.",
        "The Home page’s under-budget product shelf uses the updated threshold (<= 1000) so it can surface products priced between ₹36–₹1000.",
        "No code path still filters under-budget collections using 20 or 35 as max price."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/shop/HomePage.tsx",
          "operation": "modify",
          "description": "Update Home under-budget navigation to use collectionId slugs understood by CollectionPage (e.g., switch from under-20/under-35 to under-500/under-1000) and update Home under-budget shelf filtering to use max price 1000."
        },
        {
          "path": "frontend/src/pages/shop/CollectionPage.tsx",
          "operation": "modify",
          "description": "Update CollectionPage collectionId handling to recognize the new under-budget slugs and apply getUnderBudgetProducts thresholds of 500 and 1000; remove any remaining references to 20 or 35 in under-budget collection filtering."
        },
        {
          "path": "frontend/src/utils/shopFilters.ts",
          "operation": "modify",
          "description": "Audit and adjust any under-budget helper usage patterns (as needed) to ensure no remaining call sites rely on 20/35 thresholds for under-budget collections after the Home/Collection updates."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Increase default/max price filter bounds so CollectionPage and SearchPage do not hide products above ₹200 by default (including under-budget up to ₹1000).",
      "acceptanceCriteria": [
        "On CollectionPage, opening an under-budget collection does not show an artificially reduced set of products due to an initial default max price of 200.",
        "On SearchPage, the initial filter state allows browsing products priced above ₹200 without requiring the user to change filters first."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/shop/CollectionPage.tsx",
          "operation": "modify",
          "description": "Update the initial filter state and the reset/clear behaviors so the default priceRange max is no longer 200 (set to a value that will not hide products up to and beyond ₹1000)."
        },
        {
          "path": "frontend/src/pages/shop/SearchPage.tsx",
          "operation": "modify",
          "description": "Update the initial filter state and the reset/clear behaviors so the default priceRange max is no longer 200, ensuring the initial search browsing experience includes products priced above ₹200."
        },
        {
          "path": "frontend/src/components/shop/FilterSheet.tsx",
          "operation": "modify",
          "description": "Update the price slider bounds and reset defaults so the filter UI supports selecting ranges above ₹200 (at minimum accommodating ₹1000) and stays consistent with the updated default filter state."
        },
        {
          "path": "frontend/src/components/shop/AppliedFilterChips.tsx",
          "operation": "modify",
          "description": "Update the logic that decides whether a price filter chip is active so it reflects the new default max price (instead of assuming 200)."
        }
      ]
    }
  ]
}